Tekla Open API Reference for Tekla Structures 2025
Picker.PickObject Method
Overload List
Name | Description
PickObject(Picker.PickObjectEnum)
 Queries the user to pick one model object from the model.
PickObject(Picker.PickObjectEnum, String)
 Queries the user to pick one model object from the model with the given prompt.
Top
See Also
Reference
Picker Class
Tekla.Structures.Model.UI Namespace